# Homework

### Problem 1
In this question, we will use the csv file **Temp.csv**. 
- Read it into a data frame, call it `Temp`. (Import the packages you think you need).

In [2]:
#### Your code here

         City        State  Temperature
0         NYC     New York           67
1      Albany     New York           49
2     Buffalo     New York           38
3    Hartford  Connecticut           63
4  Bridgeport  Connecticut           58
5      Treton   New Jersey           72
6      Newark   New Jersey           68

In [2]:
import numpy as np
import pandas as pd

In [64]:
Temp = pd.read_csv('Temp.csv')

In [65]:
Temp

         City        State  Temperature
0         NYC     New York           67
1      Albany     New York           49
2     Buffalo     New York           38
3    Hartford  Connecticut           63
4  Bridgeport  Connecticut           58
5      Treton   New Jersey           72
6      Newark   New Jersey           68

- We learned that the temperature at New Haven, Connecticut is currently 58 degree fahrenheit. Add this information into the DataFrame.

In [66]:
dico = Temp.iloc[0,:].to_dict()
dico

{'City': 'NYC', 'State': 'New York', 'Temperature': 67}

In [67]:
dico_nh = {'City': 'New Haven', 'State': 'Connecticut', 'Temperature': 58}

In [68]:
Temp = pd.concat([Temp, pd.DataFrame(dico_nh, index=[0])])

In [69]:
Temp

         City        State  Temperature
0         NYC     New York           67
1      Albany     New York           49
2     Buffalo     New York           38
3    Hartford  Connecticut           63
4  Bridgeport  Connecticut           58
5      Treton   New Jersey           72
6      Newark   New Jersey           68
0   New Haven  Connecticut           58

In [72]:
Temp2 = Temp.drop(Temp.iloc[:-1])
Temp2

         City        State  Temperature
0         NYC     New York           67
1      Albany     New York           49
2     Buffalo     New York           38
3    Hartford  Connecticut           63
4  Bridgeport  Connecticut           58
5      Treton   New Jersey           72
6      Newark   New Jersey           68
0   New Haven  Connecticut           58

In [46]:
#### Your code here

- Replace the names of the states by their abbreviations. That is 
    - Connecticut --> CT
    - New Jersey  --> NJ
    - New York    --> NY

In [73]:
dico = {"Connecticut": 'CT', "New Jersey": 'NJ', "New York": 'NY'}

In [74]:
Temp['State'].update(Temp['State'].map(dico))   #Pandadorable?
Temp

         City State  Temperature
0         NYC    NY           67
1      Albany    NY           49
2     Buffalo    NY           38
3    Hartford    CT           63
4  Bridgeport    CT           58
5      Treton    NJ           72
6      Newark    NJ           68
0   New Haven    CT           58

In [49]:
#### Your code here

- Select the rows in New York.

In [75]:
Temp.loc[Temp.State=='NY', :]

      City State  Temperature
0      NYC    NY           67
1   Albany    NY           49
2  Buffalo    NY           38

In [51]:
#### Your code here

- What is the average of the temperature of cities in NY?

In [76]:
Temp.loc[Temp.State=='NY', :].mean()

Temperature    51.333333
dtype: float64

In [53]:
#### Your code here

- Find the mean and the standard deviation of the temperature of each state.

In [54]:
Temp.groupby(Temp.State)

In [77]:
Temp.groupby(Temp.State).agg(['mean', 'std'])

      Temperature
             mean        std
State
CT      59.666667   2.886751
NJ      70.000000   2.828427
NY      51.333333  14.640128

In [8]:
#### Your code here

      Temperature
             mean        std
State
CT      59.666667   2.886751
NJ      70.000000   2.828427
NY      51.333333  14.640128

- We know the capital of each state: 
    - Connecticut --> Hartford
    - New Jersey  --> Treton
    - New York    --> Albany
    
    Create a data frame, `Capital`, with two columns: State and Capital, which should look like:
    
|| State| Capital|
| :-: |:---: | :---:|
| 0| CT  | Hartford|
| 1| NJ | Treton|
| 2| NY| Albany|

In [78]:
dico = {"State": ['CT', 'NJ', 'NY'], 'Capital': ["Hartford", 'Treton', 'Albany']}

In [79]:
Capital = pd.DataFrame(dico, index=[range(3)])
Capital

    Capital State
0  Hartford    CT
1    Treton    NJ
2    Albany    NY

In [9]:
#### Your code here

    Capital State
0  Hartford    CT
1    Treton    NJ
2    Albany    NY

- Mutate a new boolean column, `Capital`, to `Temp`, which is `True` if the city in the row is the capital of the state, else `False`.

In [81]:
Temp['Capital']=Temp['City'].isin(Capital['Capital'])

In [82]:
Temp

         City State  Temperature Capital
0         NYC    NY           67   False
1      Albany    NY           49    True
2     Buffalo    NY           38   False
3    Hartford    CT           63    True
4  Bridgeport    CT           58   False
5      Treton    NJ           72    True
6      Newark    NJ           68   False
0   New Haven    CT           58   False

In [10]:
#### Your code here

         City State  Temperature Capital
0         NYC    NY           67   False
1      Albany    NY           49    True
2     Buffalo    NY           38   False
3    Hartford    CT           63    True
4  Bridgeport    CT           58   False
5   New Haven    CT           58   False
6      Treton    NJ           72    True
7      Newark    NJ           68   False

### Problem 2

- a. Load the Gross Domestic Product data for the 190 ranked countries in the file **GDP.csv**. Load **Country.csv** into a DataFrame. 
- b. Match the data based on the country shortcode. How many of the IDs match? 
- c. Sort the data frame in descending order by GDP rank. What is the 13th country in the resulting data frame? (Note: GDP formats as 123,456,789.)
- d. What is the average GDP for the "High income: OECD" and "High income: nonOECD" group?
- e. What is the average GDP for different income groups and regions?

In [84]:
#### Your code here
# (a)
import numpy as np
import pandas as pd
gdp = pd.read_csv('GDP.csv', skiprows=range(5), header= None, usecols=[0,1,3,4], nrows=190)
gdp.columns = ['CountryCode', 'Rank', 'CountryName', 'GDP']

In [86]:
gdp.head()

  CountryCode  Rank    CountryName           GDP
0         USA     1  United States   16,244,600
1         CHN     2          China    8,227,103
2         JPN     3          Japan    5,959,718
3         DEU     4        Germany    3,428,131
4         FRA     5         France    2,612,878

In [8]:
# (b)

189

In [94]:
gdp.sort_values('Rank', ascending=True).iloc[12,:]

CountryCode            ESP
Rank                    13
CountryName          Spain
GDP             1,322,965
Name: 12, dtype: object

In [10]:
# (c)

Spain

In [97]:
gdp

    CountryCode  Rank                     CountryName           GDP
0           USA     1                   United States   16,244,600
1           CHN     2                           China    8,227,103
2           JPN     3                           Japan    5,959,718
3           DEU     4                         Germany    3,428,131
4           FRA     5                          France    2,612,878
5           GBR     6                  United Kingdom    2,471,784
6           BRA     7                          Brazil    2,252,664
7           RUS     8              Russian Federation    2,014,775
8           ITA     9                           Italy    2,014,670
9           IND    10                           India    1,841,710
10          CAN    11                          Canada    1,821,424
11          AUS    12                       Australia    1,532,408
12          ESP    13                           Spain    1,322,965
13          MEX    14                          Mexico    1,178,126
14          KOR    15                     Korea, Rep.    1,129,598
15          IDN    16                       Indonesia      878,043
16          TUR    17                          Turkey      789,257
17          NLD    18                     Netherlands      770,555
18          SAU    19                    Saudi Arabia      711,050
19          CHE    20                     Switzerland      631,173
20          SWE    21                          Sweden      523,806
21          IRN    22              Iran, Islamic Rep.      514,060
22          NOR    23                          Norway      499,667
23          POL    24                          Poland      489,795
24          BEL    25                         Belgium      483,262
25          ARG    26                       Argentina      475,502
26          AUT    27                         Austria      394,708
27          ZAF    28                    South Africa      384,313
28          VEN    29                   Venezuela, RB      381,286
29          COL    30                        Colombia      369,606
..          ...   ...                             ...           ...
160         ABW   161                           Aruba        2,584
161         BDI   162                         Burundi        2,472
162         LSO   163                         Lesotho        2,448
163         MDV   164                        Maldives        2,222
164         CAF   165        Central African Republic        2,184
165         CPV   166                      Cape Verde        1,827
166         BTN   167                          Bhutan        1,780
167         LBR   168                         Liberia        1,734
168         BLZ   169                          Belize        1,493
169         TMP   170                     Timor-Leste        1,293
170         LCA   171                       St. Lucia        1,239
171         ATG   172             Antigua and Barbuda        1,134
172         SYC   173                      Seychelles        1,129
173         SLB   174                 Solomon Islands        1,008
174         GMB   175                     Gambia, The          917
175         GNB   176                   Guinea-Bissau          822
176         VUT   177                         Vanuatu          787
177         GRD   178                         Grenada          767
178         KNA   178             St. Kitts and Nevis          767
179         VCT   180  St. Vincent and the Grenadines          713
180         WSM   181                           Samoa          684
181         COM   182                         Comoros          596
182         DMA   183                        Dominica          480
183         TON   184                           Tonga          472
184         FSM   185           Micronesia, Fed. Sts.          326
185         STP   186           S�o Tom� and Principe          263
186         PLW   187                           Palau          228
187         MHL   188                Marshall Islands          182
188         KIR   189                        Kiribati          175
189         TUV   190                          Tuvalu           40

[190 rows x 4 columns]

In [ ]:
#data not in the file

In [22]:
# (d)

                                 GDP
Income Group
High income: OECD     1483917.133333
High income: nonOECD   104349.826087

In [98]:
# (e)
Same comment